Информационная_база/Catalogs/УзлыБинарногоДерева.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УзлыБинарногоДерева</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляТестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯвляетсяЛистом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Информационная_база/InformationRegisters/СтруктураБинарногоДерева.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтруктураБинарногоДерева</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СледующийУзелДерева</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыБинарногоДерева</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СостояниеСвязи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСвязиБинарногоДерева</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШаблонТеста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныБинарныхДеревьев</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РодительскийУзел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыБинарногоДерева</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОтвета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОтветовБинарногоДерева</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Информационная_база/Catalogs/УзлыБинарногоДерева/Ext/ManagerModule.bsl
// Модуль менеджера УзлыБинарногоДерева
#Область УправляемыйИнтерфейс

// Создает узел бинарного дерева
//
// Параметры:
//  Вопрос - ПланВидовХарактеристик.ВопросыДляТестирования
//  ЯвляетсяЛистом - Булево
//  Уровень - Число
//
// Возвращаемое значение:
//   СправочникСсылка.УзлыБинарногоДерева
//
Функция СоздатьУзел(Вопрос, ЯвляетсяЛистом = Ложь, Уровень = 0) Экспорт
    
    Узел = Справочники.УзлыБинарногоДерева.СоздатьЭлемент();
    Узел.Наименование = Вопрос.Наименование;
    Узел.Вопрос = Вопрос;
    Узел.ЯвляетсяЛистом = ЯвляетсяЛистом;
    Узел.Уровень = Уровень;
    Узел.Записать();
    
    Возврат Узел;
    
КонецФункции

// Получает корневой узел для шаблона
//
// Параметры:
//  Шаблон - СправочникСсылка.ШаблоныБинарныхДеревьев
//
// Возвращаемое значение:
//   СправочникСсылка.УзлыБинарногоДерева
//
Функция ПолучитьКорневойУзел(Шаблон) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    СтруктураБинарногоДерева.СледующийУзел
    |ИЗ
    |    РегистрСведений.СтруктураБинарногоДерева КАК СтруктураБинарногоДерева
    |ГДЕ
    |    СтруктураБинарногоДерева.ШаблонТеста = &Шаблон
    |    И СтруктураБинарногоДерева.РодительскийУзел = ЗНАЧЕНИЕ(Справочник.УзлыБинарногоДерева.ПустаяСсылка)
    |    И СтруктураБинарногоДерева.ТипОтвета = ЗНАЧЕНИЕ(Перечисление.ТипыОтветовБинарногоДерева.Начальный)";
    
    Запрос.УстановитьПараметр("Шаблон", Шаблон);
    
    Результат = Запрос.Выполнить().Выбрать();
    Если Результат.Следующий() Тогда
        Возврат Результат.СледующийУзел;
    КонецЕсли;
    
    Возврат Неопределено;
    
КонецФункции

#КонецОбласти
